app/views/issues/_form.html.erb

  <div class="field">
    <%= f.collection_select :status_id, Status.order(:priority), :id, :name,
                                                    {:selected => set_status(@issue.status)}%>
---
SELECT "statuses".* FROM "statuses"  ORDER BY "statuses"."priority" ASC