app/views/issues/show.html.erb

SELECT "notes".* FROM "notes" WHERE "notes"."issue_id" = ?  ORDER BY "notes"."id" DESC  [[nil, 1]]
---
  <tbody>
    <% @issue.note.reverse_order.each do |n| %>