app/controllers/issues_controller.rb

  def index
    @issues = Issue.all
---
SELECT "issues".* FROM "issues"

  def update
    respond_to do |format|
      if @issue.update(issue_params)
---
UPDATE "issues" SET "status_id" = ?, "updated_at" = ? WHERE "issues"."id" = ?  [["status_id", 3], ["updated_at", "2016-03-31 20:01:53.321316"], ["id", 1]]

    def set_issue
      @issue = Issue.find(params[:id])
---
SELECT  "issues".* FROM "issues" WHERE "issues"."id" = ? LIMIT 1  [["id", 1]]