app/controllers/users_controller.rb

UPDATE "users" SET "hash_password" = ?, "admin" = ?, "updated_at" = ? WHERE "users"."id" = ?  [["hash_password", "2d514872ed5997147337b92e4fab6b565953742f765baddd6ed407df05e3e6ad"], ["admin", "t"], ["updated_at", "2016-03-31 20:01:33.636710"], ["id", 4]]
---
  def update
    respond_to do |format|
      if @user.update(user_params)